{
    "Premium Quality": "Calidad Premium",
    "For Your Business": "Para Tu Negocio",
    "Discover our exclusive range of products designed to elevate your business operations. Quality, reliability, and excellence in every item.": "Descubre nuestra gama exclusiva de productos diseñados para elevar las operaciones de tu negocio. Calidad, fiabilidad y excelencia en cada artículo.",
    "Shop Now": "Comprar Ahora",
    "Contact Us": "Contáctanos",
    "Why Choose Us": "Por Qué Elegirnos",
    "A better way to source products": "Una mejor manera de abastecer productos",
    "We provide a seamless experience for all your business procurement needs.": "Brindamos una experiencia fluida para todas tus necesidades de adquisición empresarial.",
    "Global Reach": "Alcance Global",
    "Sourcing the best products from around the world directly to your doorstep.": "Obteniendo los mejores productos de todo el mundo directamente a tu puerta.",
    "Fast Delivery": "Entrega Rápida",
    "Efficient logistics network ensuring your orders arrive on time, every time.": "Red logística eficiente que asegura que tus pedidos lleguen a tiempo, siempre.",
    "Quality Guaranteed": "Calidad Garantizada",
    "Every product is rigorously tested to meet our high standards of quality.": "Cada producto es rigurosamente probado para cumplir con nuestros altos estándares de calidad.",
    "Home": "Inicio",
    "About Us": "Nosotros",
    "Services": "Servicios",
    "Store": "Tienda",
    "Contact": "Contacto",
    "Dashboard": "Panel",
    "Log in": "Iniciar Sesión",
    "Quick Links": "Enlaces Rápidos",
    "Contact Info": "Información de Contacto",
    "All rights reserved.": "Todos los derechos reservados.",
    "Providing top-quality products and services for your business needs. Excellence is our standard.": "Proporcionando productos y servicios de alta calidad para las necesidades de tu negocio. La excelencia es nuestro estándar.",
    "Welcome Back": "Bienvenido de Nuevo",
    "Sign in to access your dashboard": "Inicia sesión para acceder a tu panel",
    "Email Address": "Correo Electrónico",
    "Password": "Contraseña",
    "Remember me": "Recuérdame",
    "Forgot password?": "¿Olvidaste tu contraseña?",
    "Sign In": "Iniciar Sesión",
    "Store Access": "Acceso a la Tienda",
    "Enter your unique access token to browse our exclusive product catalog.": "Ingresa tu token de acceso único para explorar nuestro catálogo exclusivo de productos.",
    "Access Token": "Token de Acceso",
    "Access Store": "Acceder a la Tienda",
    "Back to Home": "Volver al Inicio",
    "CPS Caribbean Port Supply is a specialized company dedicated to providing high-quality marine, port, and industrial supplies to vessels, terminals, and logistics operators throughout the Caribbean region.": "CPS Caribbean Port Supply es una empresa especializada dedicada a proveer suministros marinos, portuarios e industriales de alta calidad a embarcaciones, terminales y operadores logísticos en toda la región del Caribe.",
    "We combine operational experience, reliable sourcing, and customer-oriented service to ensure that every delivery meets international maritime standards and strict port schedules.": "Combinamos experiencia operativa, abastecimiento confiable y servicio orientado al cliente para asegurar que cada entrega cumpla con los estándares marítimos internacionales y los estrictos cronogramas portuarios.",
    "Our commitment is to become a trusted partner for shipowners, agents, terminals, and offshore operations by delivering efficiency, safety, and reliability in every operation.": "Nuestro compromiso es convertirnos en un socio de confianza para armadores, agentes, terminales y operaciones offshore, entregando eficiencia, seguridad y confiabilidad en cada operación.",
    "Mission": "Misión",
    "To provide high-quality marine, port, and industrial supplies by delivering reliable, efficient, and timely solutions that support our clients' operations in ports and terminals across the Caribbean.": "Proveer suministros marinos, portuarios e industriales de alta calidad entregando soluciones confiables, eficientes y oportunas que apoyen las operaciones de nuestros clientes en puertos y terminales de todo el Caribe.",
    "Vision": "Visión",
    "To be a leading port and marine supply company in the Caribbean region, recognized for reliability, operational excellence, and adaptability to the needs of the international maritime market.": "Ser una empresa líder en suministros portuarios y marinos en la región del Caribe, reconocida por su confiabilidad, excelencia operativa y adaptabilidad a las necesidades del mercado marítimo internacional.",
    "Objectives": "Objetivos",
    "Ensure timely and reliable supply of products and services for port and marine operations.": "Asegurar el suministro oportuno y confiable de productos y servicios para operaciones portuarias y marinas.",
    "Maintain high quality standards and regulatory compliance.": "Mantener altos estándares de calidad y cumplimiento normativo.",
    "Build strong and long-term commercial relationships with our clients.": "Construir relaciones comerciales sólidas y a largo plazo con nuestros clientes.",
    "Continuously expand our product portfolio and regional coverage.": "Expandir continuamente nuestro portafolio de productos y cobertura regional.",
    "Optimize logistics processes to reduce operational time and costs.": "Optimizar procesos logísticos para reducir tiempos y costos operativos.",
    "Purpose": "Propósito",
    "Support efficient port and maritime operations.": "Apoyar operaciones portuarias y marítimas eficientes.",
    "Act as a strategic partner for our clients.": "Actuar como un socio estratégico para nuestros clientes.",
    "Facilitate access to reliable products in demanding operational environments.": "Facilitar el acceso a productos confiables en entornos operativos exigentes.",
    "Contribute to safer, more organized port operations.": "Contribuir a operaciones portuarias más seguras y organizadas.",
    "Core Values": "Valores Fundamentales",
    "Commitment": "Compromiso",
    "We deliver what we promise.": "Entregamos lo que prometemos.",
    "Responsibility": "Responsabilidad",
    "We act with ethics and professionalism.": "Actuamos con ética y profesionalismo.",
    "Quality": "Calidad",
    "We supply products that meet international standards.": "Suministramos productos que cumplen con estándares internacionales.",
    "Efficiency": "Eficiencia",
    "We understand the urgency of the maritime industry.": "Entendemos la urgencia de la industria marítima.",
    "Trust": "Confianza",
    "We build long-term relationships.": "Construimos relaciones a largo plazo.",
    "Customer Focus": "Enfoque al Cliente",
    "We tailor solutions to real operational needs.": "Adaptamos soluciones a las necesidades operativas reales.",
    "Why Clients Choose Us": "Por Qué Nos Eligen",
    "Proven experience in port and maritime operations.": "Experiencia comprobada en operaciones portuarias y marítimas.",
    "Fast response and personalized service.": "Respuesta rápida y servicio personalizado.",
    "Reliable, high-quality products.": "Productos confiables y de alta calidad.",
    "Strong operational knowledge of port environments.": "Sólido conocimiento operativo de entornos portuarios.",
    "Flexibility to adapt to each operation.": "Flexibilidad para adaptarse a cada operación.",
    "Results-driven and practical solutions.": "Soluciones prácticas y orientadas a resultados.",
    "Our Commitment to Quality": "Nuestro Compromiso con la Calidad",
    "At CPS Caribbean Port Supply, quality is a fundamental pillar of every operation. We are committed to supplying products that comply with international standards and the operational requirements of the maritime and port industries.": "En CPS Caribbean Port Supply, la calidad es un pilar fundamental de cada operación. Estamos comprometidos a suministrar productos que cumplan con los estándares internacionales y los requisitos operativos de las industrias marítima y portuaria.",
    "We work with trusted suppliers and apply rigorous selection processes to ensure that every product delivered is safe, reliable, and suitable for demanding environments. We understand that time, safety, and accuracy are critical in port operations, which is why we ensure timely deliveries and continuous control throughout the supply chain.": "Trabajamos con proveedores de confianza y aplicamos rigurosos procesos de selección para asegurar que cada producto entregado sea seguro, confiable y adecuado para entornos exigentes. Entendemos que el tiempo, la seguridad y la precisión son críticos en las operaciones portuarias, por lo que aseguramos entregas oportunas y control continuo en toda la cadena de suministro.",
    "Our focus on quality goes beyond products—it is reflected in our service through clear communication, prompt response, and solutions tailored to each client's needs. This approach allows us to position ourselves as a reliable and responsible partner within the maritime logistics chain.": "Nuestro enfoque en la calidad va más allá de los productos: se refleja en nuestro servicio a través de una comunicación clara, respuesta rápida y soluciones adaptadas a las necesidades de cada cliente. Este enfoque nos permite posicionarnos como un socio confiable y responsable dentro de la cadena logística marítima.",
    "Our Services": "Nuestros Servicios",
    "Comprehensive solutions for your business.": "Soluciones integrales para tu negocio.",
    "Product Sourcing": "Abastecimiento de Productos",
    "We help you find the right products at the right prices, ensuring quality and availability.": "Te ayudamos a encontrar los productos adecuados a los precios correctos, asegurando calidad y disponibilidad.",
    "Order Management": "Gestión de Pedidos",
    "Streamline your purchasing process with our intuitive order management system.": "Agiliza tu proceso de compra con nuestro intuitivo sistema de gestión de pedidos.",
    "Logistics Support": "Soporte Logístico",
    "We coordinate delivery and logistics to ensure your products arrive safely and on time.": "Coordinamos la entrega y logística para asegurar que tus productos lleguen seguros y a tiempo.",
    "Get In Touch": "Ponte en Contacto",
    "We'd love to hear from you. Send us a message and we'll respond as soon as possible.": "Nos encantaría saber de ti. Envíanos un mensaje y te responderemos lo antes posible.",
    "Send us a message": "Envíanos un mensaje",
    "Your Name": "Tu Nombre",
    "John Doe": "Juan Pérez",
    "Phone Number": "Número de Teléfono",
    "Your Message": "Tu Mensaje",
    "Tell us how we can help you...": "Cuéntanos cómo podemos ayudarte...",
    "Send Message": "Enviar Mensaje",
    "Visit Us": "Visítanos",
    "Call Us": "Llámanos",
    "24/7": "24/7",
    "Email Us": "Envíanos un Correo",
    "Follow Us": "Síguenos",
    "Language": "Idioma",
    "Orders": "Pedidos",
    "Access Tokens": "Tokens de Acceso",
    "Management": "Gestión",
    "Products": "Productos",
    "Categories": "Categorías",
    "Users": "Usuarios",
    "View Profile": "Ver Perfil",
    "Profile": "Perfil",
    "Log Out": "Cerrar Sesión",
    "Sales Report": "Reporte de Ventas",
    "Total Revenue": "Ingresos Totales",
    "Total Orders": "Pedidos Totales",
    "Total Products": "Productos Totales",
    "Vessels Served": "Barcos Atendidos",
    "Best Selling": "Más Vendido",
    "sold": "vendido(s)",
    "Monthly Sales": "Ventas Mensuales",
    "Top Selling Products": "Productos Más Vendidos",
    "Import Products": "Importar Productos",
    "Upload a CSV or Excel file to bulk import products into your catalog.": "Sube un archivo CSV o Excel para importar productos masivamente a tu catálogo.",
    "Supported formats: CSV, XLSX, XLS": "Formatos soportados: CSV, XLSX, XLS",
    "My Performance": "Mi Rendimiento",
    "Total Spend": "Gasto Total",
    "Monthly Spend": "Gasto Mensual",
    "Order List": "Lista de Pedidos",
    "Order ID": "ID de Pedido",
    "Branch": "Sucursal",
    "Date": "Fecha",
    "Total": "Total",
    "Status": "Estado",
    "Action": "Acción",
    "View Details": "Ver Detalles",
    "Pending Orders": "Pedidos Pendientes",
    "Confirmed Orders": "Pedidos Confirmados",
    "Completed Orders": "Pedidos Completados",
    "Cancelled Orders": "Pedidos Cancelados",
    "No orders found.": "No se encontraron pedidos.",
    "Generate New Token": "Generar Nuevo Token",
    "Generate a temporary access token for customers to view the store.": "Genera un token de acceso temporal para que los clientes vean la tienda.",
    "Captain Name": "Nombre del Capitán",
    "Enter captain name...": "Ingresa el nombre del capitán...",
    "Vessel Name": "Nombre del Barco",
    "Enter vessel name...": "Ingresa el nombre del barco...",
    "Recent Tokens": "Tokens Recientes",
    "Token": "Token",
    "Captain": "Capitán",
    "Vessel": "Barco",
    "Created At": "Creado El",
    "Active": "Activo",
    "Inactive": "Inactivo"
}